[
    
    {
        "clip_name": "ed718fd9c28f6265",
        "clip_path": "video_clips/954L4DQHgMU/ed718fd9c28f6265.mp4",
        "pose_file": "pose_files/ed718fd9c28f6265.txt",
        "caption": "The video shows a large group of fish swimming in the ocean. The water is a deep blue color, and the fish are swimming in a coordinated manner. The fish are of various sizes and shapes, and they move together as a group. The video captures the beauty and tranquility of the underwater world."
    },
{
    "clip_name": "ed718fd9c28f6265",
    "clip_path": "video_clips/954L4DQHgMU/ed718fd9c28f6265.mp4",
    "pose_file": "pose_files/ed718fd9c28f6265.txt",
    "caption": "The video shows a drone flying over a rural area with trees in autumn colors. The drone is flying over a house, and there is a small airplane flying in the distance. The colors of the trees are orange, yellow, and green. The video is shot from a high angle, giving a bird's eye view of the landscape."
},
{
    "clip_name": "f120f74e540d724c",
    "clip_path": "video_clips/f120f74e540d724c.mp4",
    "pose_file": "pose_files/f120f74e540d724c.txt",
    "caption": "The video shows a person swimming underwater in a snorkeling mask and snorkel. The water is clear and blue, and the person is moving slowly through it. The person is wearing a black swimsuit and has their arms outstretched as they swim. There are rocks and coral visible on the ocean floor, and the person is swimming near them. The person appears to be enjoying the experience, and the water is calm and serene."
},
{
    "clip_name": "ed81ed922c6c7225",
    "clip_path": "video_clips/9KVuhwOAX-Q/ed81ed922c6c7225.mp4",
    "pose_file": "pose_files/ed81ed922c6c7225.txt",
    "caption": "The video shows two pandas in a cage. They are eating bamboo. They are black and white in color. The cage is made of metal bars."
},
{
    "clip_name": "d84343c25315d7e9",
    "clip_path": "video_clips/d84343c25315d7e9.mp4",
    "pose_file": "pose_files/d84343c25315d7e9.txt",
    "caption": "In the video, a cat is seen sitting on the floor next to a window. The cat is looking out the window and appears to be watching something outside. The cat is a tabby with a mix of brown, black, and white fur. The window is open, and there is a white cord hanging down from it. The cat is sitting on a beige carpet, and there is a wooden door in the background. The cat's eyes are wide open, and it seems to be focused on something outside the window."
},
{
    "clip_name": "d886b5dfef09feb2",
    "clip_path": "video_clips/d886b5dfef09feb2.mp4",
    "pose_file": "pose_files/d886b5dfef09feb2.txt",
    "caption": "In the video, a woman is seen riding a horse in a fenced area. She is wearing a blue shirt and jeans, and the horse is brown with a black mane. The woman is holding the reins and guiding the horse around the fenced area. The horse is walking and trotting at different points in the video. The background consists of trees and a clear sky."
},
{
    "clip_name": "d8a6f5f5687ee167",
    "clip_path": "video_clips/2tc-UKuuA3Y/d8a6f5f5687ee167.mp4",
    "pose_file": "pose_files/d8a6f5f5687ee167.txt",
    "caption": "The video shows a bear walking along the edge of a river. The bear is brown in color and appears to be walking slowly and calmly. The river is flowing rapidly and there are rocks and plants visible in the background. The bear is the only animal in the video and there are no other animals or people visible."
},
{
    "clip_name": "d91691d9b43cd983",
    "clip_path": "video_clips/iA-Q-uS9beQ/d91691d9b43cd983.mp4",
    "pose_file": "pose_files/d91691d9b43cd983.txt",
    "caption": "The video shows a baseball game in progress. The pitcher is throwing the ball to the batter, who is standing ready at home plate. The catcher is positioned behind the batter, and the umpire is standing behind the catcher. The field is well-maintained with green grass and a dirt infield. The players are wearing their respective team uniforms. The scoreboard is visible in the background, indicating the current score and inning. The pitcher throws the ball, and the batter swings, hitting the ball into the field. The players on the field are seen running to catch the ball. The video captures the excitement and energy of the game, with the players' movements and the sound of the crowd in the background."
},
{
    "clip_name": "d932fa3862974507",
    "clip_path": "video_clips/7AlwoRpSzMk/d932fa3862974507.mp4",
    "pose_file": "pose_files/d932fa3862974507.txt",
    "caption": "The video shows a soccer game in progress. The players are wearing red and white uniforms. The goalie is wearing a yellow uniform. The ball is being kicked towards the goal, and the goalie is trying to block it. The crowd is cheering in the background."
},
{
    "clip_name": "d971457c81bca597",
    "clip_path": "video_clips/BFI2n0eoJ3g/d971457c81bca597.mp4",
    "pose_file": "pose_files/d971457c81bca597.txt",
    "caption": "The video shows a person's hand touching the tire of a truck. The truck is parked on a dirt road, and there are two other trucks parked in the background. The person's hand is visible in the foreground, and the truck is silver in color. The tire is black with a silver rim. The person's hand moves around the tire, touching it from different angles. The video is shot during the day, and the sky is overcast."
},
{
    "clip_name": "d99443d8dcb56d90",
    "clip_path": "video_clips/BFI2n0eoJ3g/d99443d8dcb56d90.mp4",
    "pose_file": "pose_files/d99443d8dcb56d90.txt",
    "caption": "The video shows a group of people walking through a field of green plants. They are wearing hats and seem to be picking something from the plants. The field is lush and green, and the people are spread out across the field. The video is taken from an aerial perspective, and the camera moves slowly over the field, giving a clear view of the people and the plants."
},
{
    "clip_name": "d9adc7ad73a2dfa4",
    "clip_path": "video_clips/d9adc7ad73a2dfa4.mp4",
    "pose_file": "pose_files/d9adc7ad73a2dfa4.txt",
    "caption": "The video shows a person riding a motorcycle on a beach. The motorcycle is black and white in color, and the rider is wearing a white helmet. The beach is sandy, and the ocean is visible in the background. The sky is blue with some clouds. The rider is seen from different angles as they ride along the beach."
}]